cypress/fixtures/transferencias/realizarTransferencias.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sn="http://www.bncr.fi.cr/soa/SN_RealizaTransferencias">
   <soapenv:Header/>
   <soapenv:Body>
      <sn:solicitud>
         <sn:encabezado>
            <sn:fechaHoraConsumo>2020-01-26T19:15:54.294Z</sn:fechaHoraConsumo>
            <sn:canalConsumidor>IBP</sn:canalConsumidor>
            <sn:usuarioConsumidor>113720104</sn:usuarioConsumidor>
            <sn:direccionIPConsumo>?</sn:direccionIPConsumo>
            <sn:nombreServicio>?</sn:nombreServicio>
         </sn:encabezado>
         <sn:cuerpo>
            <sn:entradaServicio>
               <sn:Cliente>428402</sn:Cliente>
               <sn:transaccion>TRANSFERENCIAS</sn:transaccion>
               <sn:ispec>IBTEF</sn:ispec>
               <sn:ipCliente>10.0.238.152</sn:ipCliente>
               <sn:modoValidar></sn:modoValidar>
               <sn:accionPortwise></sn:accionPortwise>
               <sn:OTP></sn:OTP>
               <sn:indCuentaPropia>N</sn:indCuentaPropia>
               <sn:indCuentaFavorita></sn:indCuentaFavorita>
               <sn:indActualizarCorreo>S</sn:indActualizarCorreo>
               <sn:indEnviarCorreo>S</sn:indEnviarCorreo>
               <sn:Correo></sn:Correo>
               <sn:CorreoCopia></sn:CorreoCopia>
               <sn:oficina>228</sn:oficina>
               <sn:monedaServicio>1</sn:monedaServicio>
               <sn:montoMovimiento>10.00</sn:montoMovimiento>
               <sn:monedaTransaccion>1</sn:monedaTransaccion>
               <sn:tipoIdentificacion>1</sn:tipoIdentificacion>
               <sn:numeroIdentificacion>113720104</sn:numeroIdentificacion>
               <sn:cuentaClienteOrigen></sn:cuentaClienteOrigen>
               <sn:productoOrigen>100</sn:productoOrigen>
               <sn:monedaOrigen>01</sn:monedaOrigen>
               <sn:oficinaOrigen>080</sn:oficinaOrigen>
               <sn:numeroCuentaOrigen>100015</sn:numeroCuentaOrigen>
               <sn:digitoVerificadorOrigen>3</sn:digitoVerificadorOrigen>
               <sn:cuentaClienteDestino></sn:cuentaClienteDestino>
               <sn:productoDestino>100</sn:productoDestino>
               <sn:monedaDestino>01</sn:monedaDestino>
               <sn:oficinaDestino>208</sn:oficinaDestino>
               <sn:numeroCuentaDestino>000084</sn:numeroCuentaDestino>
               <sn:digitoVerificadorDestino>2</sn:digitoVerificadorDestino>
               <sn:detalleMovimiento>prueba de request joseth</sn:detalleMovimiento>
               <sn:nombreDepositante>RUIZ CAMPOS CARLOS LUIS</sn:nombreDepositante>
               <sn:motivoCompraVenta></sn:motivoCompraVenta>
               <sn:subModuloCV>TRANSFERENCIAS</sn:subModuloCV>
               <sn:tipoRelacion></sn:tipoRelacion>
               <sn:mayorDetalle></sn:mayorDetalle>
               <sn:otroDepositante></sn:otroDepositante>
               <sn:cuentaIBANOrigen>CR34 0151 0801 0011 0001 56</sn:cuentaIBANOrigen>
               <sn:cuentaIBANDestino>CR32 0151 2081 0010 0008 40</sn:cuentaIBANDestino>
               <sn:mostrarCuentaDebito>S</sn:mostrarCuentaDebito>
               <sn:mostrarCuentaIBAN>S</sn:mostrarCuentaIBAN>
               <sn:firmaElectronica>N</sn:firmaElectronica>
               <sn:descripcionSINPE></sn:descripcionSINPE>
               <!--Optional:-->
               <sn:resultadoFirma>1</sn:resultadoFirma>
               <!--Optional:-->
               <sn:idReferenciaFirma>0</sn:idReferenciaFirma>
            </sn:entradaServicio>
         </sn:cuerpo>
      </sn:solicitud>
   </soapenv:Body>
</soapenv:Envelope>